Tekla Open API Reference for Tekla Structures 2025
Operation.CreateNCFilesFromAll Method
Overload List
Name | Description
CreateNCFilesFromAll(String, String)
 Creates NC files from all parts using the given NC template name.
See Tekla Structures Help for more information about NC files.
CreateNCFilesFromAll(String, String, Boolean, String, Boolean, String)
 Creates NC files from all parts using the given NC template name.
See Tekla Structures Help for more information about NC files.
Top
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace